{"sections":{"sr_slider_WdT9cV":{"type":"SR_Slider","settings":{"image":"shopify:\/\/shop_images\/Real_Tony_Hamawy_Bride.jpg"}},"main":{"type":"feature-columns","blocks":{"text_block_AmXzU8":{"type":"text_block","settings":{"enable_image":true,"image":"shopify:\/\/shop_images\/favicon.jpg","title":"Unwavering Value","text":"<p>We don't just follow trends; we make custom wedding dresses that are unique to you. We turn your concept into a timeless masterpiece, with fine, luxurious fabrics, precise craftsmanship, and environmentally mindful techniques to create classic silhouettes to modern details. Each gown is a celebration of responsible design and superb craftsmanship.<br\/><\/p>","button_label":"","button_link":""}},"text_block_dFx9kN":{"type":"text_block","settings":{"enable_image":true,"image":"shopify:\/\/shop_images\/favicon.jpg","title":"Personalized Customer Service","text":"<p>We prioritize your needs<br\/>and desires. Our collaborative design process focuses on knowing your dreams<br\/>and preferences. Tony will help you through the whole process, including in-depth conversations, detailed sketches, and meticulous fittings, to ensure the perfect fit and capture the essence of your dream dress.<\/p>","button_label":"","button_link":""}},"text_block_WkqXj6":{"type":"text_block","settings":{"enable_image":true,"image":"shopify:\/\/shop_images\/favicon.jpg","title":"Design Your Own Dream Gown","text":"<p>Design a custom wedding gown as unique as your love story. With Tony Hamawy, you can design a wedding dress that matches your style and personality. Collaborate with Tony to bring your vision to life and create a hand-crafted couture wedding gown made in USA that embodies you on your special day.<\/p>","button_label":"","button_link":""}},"text_block_PnRghn":{"type":"text_block","settings":{"enable_image":true,"image":"shopify:\/\/shop_images\/favicon.jpg","title":"Fine Fabrics and Workmanship","text":"<p>We use only the finest materials, from fine silks to luxurious satins. Every custom gown is well-designed and crafted in the USA, with close attention to every detail providing a really luxurious experience.  We design and build our gowns to endure, so you can treasure the feeling of your special day for years to come.  Your dress will stay as beautiful as your memories, reminding you of that magical moment whenever you see it.<\/p>","button_label":"","button_link":""}},"text_block_fhMLew":{"type":"text_block","settings":{"enable_image":true,"image":"shopify:\/\/shop_images\/favicon.jpg","title":"Effortless Wedding Dress Shopping","text":"<p>Finding your perfect wedding dress should be a delightful and unforgettable experience. Tony Hamawy ensures a simple and enjoyable process. Schedule an appointment with an expert designer to create your unique wedding gown effortlessly. Choose your favorite dress and get ready to look amazing on your big day. Once your gown is complete, we promise an effortless experience, by delivering it within the specified timeframe.<\/p>","button_label":"","button_link":""}},"text_block_LD88aM":{"type":"text_block","settings":{"enable_image":true,"image":"shopify:\/\/shop_images\/favicon.jpg","title":"Complete Satisfaction","text":"<p>Ensuring your total satisfaction is our top priority at Tony Hamawy. We strive to exceed your expectations and create an exceptional experience for you. Building lasting relationships with our brides is key, guaranteeing your satisfaction from the design process through to your wedding day. Count on us for transparency and clear communication throughout.<br\/><a href=\"\/pages\/virtual-appointment\" title=\"Virtual Appointment\">Book Your Appointment Now!<\/a><\/p>","button_label":"","button_link":""}}},"block_order":["text_block_AmXzU8","text_block_dFx9kN","text_block_WkqXj6","text_block_PnRghn","text_block_fhMLew","text_block_LD88aM"],"custom_css":[".grid.grid--uniform {margin-bottom: 40px;}"],"settings":{"title":"Why Tony Hamawy","align_text":"center"}},"rich_text_d9GUq8":{"type":"rich-text","disabled":true,"settings":{"full_width":false,"section_title":"","text":"","button":"","link":"","button2":"","link2":"","text_size":"medium"}},"rich_text_CWhFnq":{"type":"rich-text","disabled":true,"settings":{"full_width":false,"section_title":"Why Tony Hamawy?","text":"<p><br\/><br\/>We believe that every bride deserves to wear a wedding dress that shows her unique story. Here's what differentiates us and makes your experience as memorable as your love story:<strong><br\/><br\/>Unwavering Value<br\/><\/strong>We don't just follow trends; we make dresses that are unique to you. We turn your concept into a timeless masterpiece, with fine luxurious fabrics, precise craftsmanship, and environmentally mindful techniques to create classic silhouettes to modern details. Each gown is a celebration of responsible design and superb craftsmanship.<br\/><br\/><strong>Personalized Customer Service<\/strong><br\/>We prioritize your needs and desires. Our collaborative design process focuses on knowing your dreams and preferences. Tony and his team will help you through the whole process, including consultations, drawings, and fittings.<br\/><br\/><strong>Design Your Own Dream Gown<\/strong><br\/>Unlike many bridal businesses that sell pre-designed dresses,Tony Hamawy allows you to create a wedding dress that is your own. With Tony Hamawy, you may create a gown that matches your style and personality. Collaborate directly with Tony to bring your idea to reality, resulting in a handmade gown as unique as your love story.<br\/><br\/><strong>Fine Fabrics and Workmanship<\/strong><br\/>We use only the finest materials, from fine silks to luxurious satins. Every Custom gown is well-designed and crafted here in the US, with close attention to every detail providing a really luxurious experience.  We design and build our gowns to endure, so you can treasure the feeling of your special day for years to come.  Your dress will stay as beautiful as your memories, reminding you of that magical moment whenever you see it.<br\/><br\/><strong>Stress-Free Shopping<\/strong><br\/>Your wedding dress-buying experience should be enjoyable and memorable. Tony Hamawy strives here to make the process simple and fun. Schedule an appointment with a skilled designer and have your unique wedding gown designed without worry. Choose your favorite wedding dress and ready to look amazing on your big day. Once the product is complete, we will send it within the timeframe specified, promising an easy and stress-free experience from start to finish.<br\/><br\/><strong>Complete Satisfaction.<\/strong><br\/>At Tony Hamawy, your complete satisfaction is our top priority. We work hard to ensure that your gown exceeds your expectations and provides an amazing experience for you. We believe in developing long-term connections with our brides, ensuring their complete satisfaction from the design process until the wedding day. We assure complete transparency and open communication.<br\/><\/p>","button":"","link":"","button2":"","link2":"","text_size":"medium"}}},"order":["sr_slider_WdT9cV","main","rich_text_d9GUq8","rich_text_CWhFnq"]}